brew "argon2"
brew "autoconf"
brew "readline"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash"
brew "oniguruma"
brew "bat"
brew "bison"
brew "bottom"
brew "btop"
brew "bzip2"
brew "cmake"
brew "csvkit"
brew "curl"
brew "diffutils"
brew "dnsmasq"
brew "dust"
brew "eza"
brew "fastfetch"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gd"
brew "git"
brew "git-remote-codecommit"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-typist"
brew "gnupg"
brew "grep"
brew "gron"
brew "gzip"
brew "hugo"
brew "imagemagick"
brew "jnv"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libpq"
brew "libsodium"
brew "libxml2"
brew "libzip"
brew "mas"
brew "mise"
brew "mkcert"
brew "monolith"
brew "moreutils"
brew "zlib"
brew "mysql-client@8.0"
brew "nano"
brew "neovim"
brew "nkf"
brew "openssl@3.0"
brew "pkgconf"
brew "qcachegrind"
brew "re2c"
brew "ripgrep"
brew "rpm2cpio"
brew "sevenzip"
brew "sheldon"
brew "starship"
brew "tesseract-lang"
brew "tidy-html5"
brew "tokei"
brew "unzip"
brew "wget"
brew "xpdf"
brew "xsv"
brew "yt-dlp"
brew "zip"
brew "zsh"
cask "adobe-acrobat-reader"
cask "amazon-q"
cask "appcleaner"
cask "crystalfetch"
cask "dbeaver-community"
cask "devtoys"
cask "diffmerge"
cask "displaylink"
cask "firefox"
cask "font-ipafont"
cask "font-noto-sans-cjk-jp"
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "jordanbaird-ice"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "microsoft-edge"
cask "monitorcontrol"
cask "obsidian"
cask "rancher"
cask "raycast"
cask "shottr"
cask "sourcetree"
cask "switchhosts"
cask "the-unarchiver"
cask "utm"
cask "visual-studio-code"
cask "zoom"
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "amatiasq.sort-imports"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "bmewburn.vscode-intelephense-client"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "hverlin.mise-vscode"
vscode "ics.japanese-proofreading"
vscode "ikki2000.ikki-vscode-dark-theme"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jdinhlife.gruvbox"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "mubaidr.vuejs-extension-pack"
vscode "naoray.laravel-goto-components"
vscode "neilbrayfield.php-docblocker"
vscode "nuxt.mdc"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pflannery.vscode-versionlens"
vscode "pgl.laravel-jump-controller"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "remisa.shellman"
vscode "richie5um2.vscode-sort-json"
vscode "rogalmic.bash-debug"
vscode "rpinski.shebang-snippets"
vscode "ryu1kn.partial-diff"
vscode "sdras.vue-vscode-snippets"
vscode "seatonjiang.gitmoji-vscode"
vscode "shufo.vscode-blade-formatter"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
